app/controllers/dashboard_controller.rb

    def index
       updateMetrics if Dataset.count == 0 or Dataset.last.created_at.to_i < 12.hours.ago.to_i
---
INSERT INTO "datasets" ("active", "active_canceled_at_period_end", "amount_charged_today", "amount_refunded_today", "canceled", "charges_today", "churn", "churn_rate", "created_at", "past_due", "refunds_today", "trialing", "trialing_canceled_at_period_end", "unpaid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "datasets".* FROM "datasets" ORDER BY "datasets"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "datasets"